# PathOfTravelFromRoom Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathOfTravelFromRoom Property
ParameterTypeId Class See Also
---
"From Room"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathOfTravelFromRoom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathOfTravelFromRoom As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathOfTravelFromRoom {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace